app/views/sessions/new.html.erb

SELECT "markets".* FROM "markets"
SELECT "vendors".* FROM "vendors"
---
  <% if @type == 'market' %>
    <%= f.collection_select :id, Market.all, :id, :name %>
  <% elsif @type == 'vendor' %>
    <%= f.collection_select :id, Vendor.all, :id, :name %>