app/views/users/show.html.erb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."market_id" = ?  [["market_id", 24]]
---

  <% @market.vendors.each do |vendor| %>