app/controllers/vendors_controller.rb

  def index
    @vendor = Vendor.find(current_user.id)
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]